engineer-ae3o/stm32-hal-library/components/drivers/src/spi.c
#include "stm32f411xe.h"
#include "drivers/gpio.h"
#include "utils/common.h"
#include "drivers/spi.h"
#include "drivers/dma.h"
#include "utils/err.h"

#include <string.h>
#include <stddef.h>


// Mapping for the DMA streams to the SPI peripheral instances
static const dma_stream_map_t s_spi_i2s_dma_map[] = {
    // SPI1: DMA not supported: Not enough streams to go round other peripherals
    {
        .tx = {.stream = NULL, .channel = 0},
        .rx = {.stream = NULL, .channel = 0},
    },
    // SPI2
    {
        .tx = {.stream = DMA1_Stream4, .channel = 0},
        .rx = {.stream = DMA1_Stream3, .channel = 0},
    },
    // SPI3
    {
        .tx = {.stream = DMA1_Stream7, .channel = 0},
        .rx = {.stream = DMA1_Stream2, .channel = 0},
    },
    // SPI4
    {
        .tx = {.stream = DMA2_Stream1, .channel = 4},
        .rx = {.stream = DMA2_Stream4, .channel = 4},
    },
    // SPI5: DMA not supported: Not enough streams to go round other peripherals
    {
        .tx = {.stream = NULL, .channel = 0},
        .rx = {.stream = NULL, .channel = 0},
    },
};

// The SPI instances: The ISRs invoked when a DMA event occurred
static dma_stream_ctx_t s_dma_stream_ctx[ARRAY_SIZE(s_spi_i2s_dma_map)] = {};

#define ENABLE_SPI()                                                                                                                                 \
    do {                                                                                                                                             \
        handle->CR1 |= SPI_CR1_SPE;                                                                                                                  \
        __DSB();                                                                                                                                     \
    } while (0)

#define DISABLE_SPI()                                                                                                                                \
    do {                                                                                                                                             \
        handle->CR1 &= ~SPI_CR1_SPE;                                                                                                                 \
        __DSB();                                                                                                                                     \
    } while (0)


// Helpers
[[__gnu__::__always_inline__]] static inline uint8_t get_index(const SPI_TypeDef* handle) {
    if (handle == SPI1) {
        return 0U;
    } else if (handle == SPI2) {
        return 1U;
    } else if (handle == SPI3) {
        return 2U;
    } else if (handle == SPI4) {
        return 3U;
    } else if (handle == SPI5) {
        return 4U;
    } else {
        return 0xFFU;
    }
}

[[__gnu__::__always_inline__]] static inline void isr_tx_helper(SPI_TypeDef* handle) {
    const uint8_t idx = get_index(handle);
    ASSERT(idx != 0xFFU);

    // Clear any flags that were set and get the error status
    hal_err_t ret = dma_isr_helper(s_spi_i2s_dma_map[idx].tx.stream);

    // Transfers require us to poll on the TXE and BSY flags even after data has
    // been shifted out. If they're not in the required state, an error occurred

    // Poll till TXE has been set
    // Skip polling if an error has occurred
    if (ret == HAL_OK) {
        uint32_t timeout = TIMEOUT_CYCLES;
        while (!(handle->SR & SPI_SR_TXE) && (--timeout));
        if (timeout == 0) {
            ret = HAL_ERR_SPI_TXE_FAILED_TO_SET;
        }
    }

    // Poll till BSY has been cleared
    // Skip polling BSY if TXE failed to set or another error occurred
    if (ret == HAL_OK) {
        uint32_t timeout = TIMEOUT_CYCLES;
        while ((handle->SR & SPI_SR_BSY) && (--timeout));
        if (timeout == 0) {
            ret = HAL_ERR_SPI_BSY_FAILED_TO_CLEAR;
        }
    }

    // Disable only after all transactions have completed
    DISABLE_SPI();

    // Disable I2S as well since the interrupt could have been triggered by it
    handle->I2SCFGR &= ~SPI_I2SCFGR_I2SE;

    __disable_irq();

    // Return if no callback registered
    if (s_dma_stream_ctx[idx].tx.callback == NULL) {
        __enable_irq();
        return;
    }

    // Save the user callback so we can clear it's global array position
    const dma_done_cb_t local_cb  = s_dma_stream_ctx[idx].tx.callback;
    void* const         local_arg = s_dma_stream_ctx[idx].tx.arg;

    // Only clear the user callback if not in circular mode
    if (!(s_spi_i2s_dma_map[idx].tx.stream->CR & DMA_SxCR_CIRC)) {
        s_dma_stream_ctx[idx].tx.callback = NULL;
        s_dma_stream_ctx[idx].tx.arg      = NULL;
    }

    __enable_irq();

    // Finally, invoke the user callback
    local_cb(local_arg, ret);
}

[[__gnu__::__always_inline__]] static inline void isr_rx_helper(SPI_TypeDef* handle) {
    const uint8_t idx = get_index(handle);
    ASSERT(idx != 0xFFU);

    // Clear any flags that were set and get the error status
    hal_err_t ret = dma_isr_helper(s_spi_i2s_dma_map[idx].rx.stream);
    DISABLE_SPI();

    // Disable I2S as well since the interrupt could have been triggered by it
    handle->I2SCFGR &= ~SPI_I2SCFGR_I2SE;

    __disable_irq();

    // Return if no callback registered
    if (s_dma_stream_ctx[idx].rx.callback == NULL) {
        __enable_irq();
        return;
    }

    // Save the user callback so we can clear it's global array position
    const dma_done_cb_t local_cb  = s_dma_stream_ctx[idx].rx.callback;
    void* const         local_arg = s_dma_stream_ctx[idx].rx.arg;

    // Only clear the user callback if not in circular mode
    if (!(s_spi_i2s_dma_map[idx].rx.stream->CR & DMA_SxCR_CIRC)) {
        s_dma_stream_ctx[idx].rx.callback = NULL;
        s_dma_stream_ctx[idx].rx.arg      = NULL;
    }

    __enable_irq();

    // Finally, invoke the user callback
    local_cb(local_arg, ret);
}


// General API
hal_err_t spix_clk_enable(SPI_TypeDef* handle, bool enable) {
    if (enable) {
        if (handle == SPI1) {
            RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;
        } else if (handle == SPI2) {
            RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;
        } else if (handle == SPI3) {
            RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;
        } else if (handle == SPI4) {
            RCC->APB2ENR |= RCC_APB2ENR_SPI4EN;
        } else if (handle == SPI5) {
            RCC->APB2ENR |= RCC_APB2ENR_SPI5EN;
        } else {
            return HAL_ERR_INVALID_ARG;
        }

    } else {
        if (handle == SPI1) {
            RCC->APB2ENR &= ~RCC_APB2ENR_SPI1EN;
        } else if (handle == SPI2) {
            RCC->APB1ENR &= ~RCC_APB1ENR_SPI2EN;
        } else if (handle == SPI3) {
            RCC->APB1ENR &= ~RCC_APB1ENR_SPI3EN;
        } else if (handle == SPI4) {
            RCC->APB2ENR &= ~RCC_APB2ENR_SPI4EN;
        } else if (handle == SPI5) {
            RCC->APB2ENR &= ~RCC_APB2ENR_SPI5EN;
        } else {
            return HAL_ERR_INVALID_ARG;
        }
    }

    __DSB();
    return HAL_OK;
}

hal_err_t spi_master_init(SPI_TypeDef* handle, const spi_master_config_t* config) {
    if (handle == NULL || config == NULL || (!config->use_miso && !config->use_mosi)) {
        return HAL_ERR_INVALID_ARG;
    }

    // Disable the SPI (and I2S) peripheral before modifying it's internal state
    DISABLE_SPI();

    // Deselect I2S since in SPI mode
    handle->I2SCFGR &= ~SPI_I2SCFGR_I2SMOD;

    uint32_t cr1_mask = handle->CR1;
    cr1_mask &= ~SPI_CR1_BR;
    cr1_mask |= (((uint32_t)config->prescaler << SPI_CR1_BR_Pos) | // Clock prescaler
                 SPI_CR1_SSM |                                     // Software slave select
                 SPI_CR1_SSI |                                     // Set internal slave to high
                 SPI_CR1_MSTR);                                    // SPI in master mode

    cr1_mask &= ~(SPI_CR1_LSBFIRST | // MSB first
                  SPI_CR1_RXONLY |   // TX and RX
                  SPI_CR1_CRCEN |    // Hardware CRC disable
                  SPI_CR1_CRCNEXT |  // No CRC phase; data phase always
                  SPI_CR1_BIDIMODE | // MOSI and MISO used
                  SPI_CR1_BIDIOE);   // Dual communication

